Тема: Многомерные динамические массивы
Домашнее задание
Задание 1:
Написать функцию, добавляющую столбец двухмерному массиву в указанную позицию.

Задание 2:
Написать функцию, удаляющую столбец двухмерного массива по указанному номеру.

Задание 3:
Дана матрица порядка MxN (M строк, N столбцов). Необходимо заполнить ее значениями и
написать функцию, осуществляющую циклический сдвиг строк и/или столбцов массива
указанное количество раз и в указанную сторону.

Задание 4:
Транспонирование матрицы – это операция, после которой столбцы прежней матрицы
становятся строками, а строки столбцами. Напишите функцию транспонирования матрицы.

Задание 5:
Создайте динамический массив, хранящий в первой строке имя, а во второй - телефон.
Организуйте поиск по имени и по номеру телефона и возможность ввода и изменения данных.


Тема: Структуры
Домашнее задание
Задание 1:
Создайте структуру, описывающую комплексное число. Реализуйте арифметические операции
с комплексными числами: сумму, разность, умножение, деление.

Задание 2:
Реализовать структуру «Автомобиль» (длина, клиренс (высота посадки), объем двигателя,
мощность двигателя, диаметр колес, цвет, тип коробки передач). Создайте функции для задания
значений, отображения значений, поиска значений.

Задание 3:
Разработайте программу «Библиотека». Создайте структуру «Книга» (название, автор,
издательство, жанр). Создайте массив из 10 книг. Реализуйте для него следующие возможности:
Редактировать книгу
Печать всех книг
Поиск книг по автору
Поиск книги по названию
Сортировка массива по названию книг
Сортировка массива по автору
Сортировка массива по издательству

Задание 4:
Реализовать структуру «Машина» (цвет, модель, номер). Номер машины может представлять из
себя или пятизначный номер или слово до 8 символов.
Рекомендации: номер реализовать как объединение.
Создать экземпляр структуры «Машина» и реализовать для него следующие функции:
Заполнение машины
Печать машины
Создать массив из 10 экземпляров структуры «Машина» и реализовать для него следующие
функции:
Редактировать машину
Печать всех машин
Поиск машины по номеру